{
  "facts": [
    {
      "category": "history",
      "content": "Emperor Akbar was the first emperor of the Mughal dynasty."
    },
    {
      "category": "history",
      "content": "Emperor Akbar, first emperor of the Mughal dynasty, was succeeded by his son Jahangir. The direct translation of Jahangir is 'world-seizer'"
    },
    {
      "category": "history",
      "content": "The third emperor of the Mughal dynasty was emperor Shah Jahan, which translates to 'King of the world'. He was responsible for creating the Taj Mahal, as a gift to his wife."
    },
    {
      "category": "film",
      "content": "Francis For Coppola first tried to get Megalopolis made in 1983 - he only eventually made the film in 2024, funding the film completely himself through his wine business"
    },
    {
      "category": "film",
      "content": "Many people were quick to point out the historical inaccuracies in Gladiator 2, such as newspapers featuring in the film 1200 years before the invention of the first printing press. In response, Ridley Scott had one thing to say to the fans - 'Grow up'."
    },
    {
      "category": "film",
      "content": "The trilogy of films made by Edgar Wright, Simon Pegg, and Nick Frost is called 'The Cornetto Trilogy'. This is a joke name based on the fact that in every film in the trilogy, one of the characters eats a cornetto."
    },
    {
      "category": "music",
      "content": "Rick James and Prince famously hated each other. At one point this was so bad that James stole Prince's synth. At the time synths were hard to program, and Prince was one of the only artists that had done it successfully. Rick James then used the synth for his song Superfreak. Years later Rick James finally returned the synth to Prince, long after he would've needed it, with a simple message: f*** you"
    },
    {
      "category": "music",
      "content": "Prior to writing their mashup album, numb/encore, Jay-Z had never met the members of Linkin Park. The first time they met was in the studio to record 99 problems/I'm about to break"
    },
    {
      "category": "music",
      "content": "Kanye West had a long-time girlfriend that he had been with since high school, but unfortunately soon after his mum died they broke up, leading to two heartbreaks in a very short space of time. As sad as this was for him, it was great for fans, as this birthed the album 808s and Heartbreak"
    },
    {
      "category": "science",
      "content": "Sharks haven't needed to evolve for 450 million years. To put this in perspective, the earliest dinosaurs existed around 230 million years ago"
    }
  ]
}